In [1]:
import pandas as pd
import numpy as np

In [2]:
info = {
    "Name" : ["Harsh","Rahul","Shreya"],
    "CGPA" : ["9.5","8.3","8.8"]
}
df = pd.DataFrame(info)

In [3]:
print(df)

     Name CGPA
0   Harsh  9.5
1   Rahul  8.3
2  Shreya  8.8

In [4]:
df

     Name CGPA
0   Harsh  9.5
1   Rahul  8.3
2  Shreya  8.8

In [5]:
#series 1 dimensional labeled array
s= pd.Series([1,2,3,4,5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
print(type(s))
print(s[0])

<class 'pandas.Series'>
1

In [7]:
print(s[3])

4

In [8]:
s = pd.Series(["23","21","25","31"],index =["Adam","eva","finch","sachin"])
print(s)
s

Adam      23
eva       21
finch     25
sachin    31
dtype: str

Adam      23
eva       21
finch     25
sachin    31
dtype: str

In [9]:
print(s["Adam"])
print(s["sachin"])

23
31

In [10]:
print(s.index)

Index(['Adam', 'eva', 'finch', 'sachin'], dtype='str')

In [11]:
# property
# homogenous,vectorized operation
#handle missing value with Nan
#mutable value , immutable size

In [12]:
 # data Frames  - 2D labelled Array

In [13]:
info = {
    "Name" : ["Adam" , "eve"],
    "Age":[21,24],
    "CGPA":[9.8,9.4],


}

In [14]:
df = pd.DataFrame(info)
print(df,type(df))

   Name  Age  CGPA
0  Adam   21   9.8
1   eve   24   9.4 <class 'pandas.DataFrame'>

In [15]:
df

   Name  Age  CGPA
0  Adam   21   9.8
1   eve   24   9.4

In [16]:
print(df.index)

RangeIndex(start=0, stop=2, step=1)

In [17]:
print(df.columns)

Index(['Name', 'Age', 'CGPA'], dtype='str')

In [18]:
df = pd.DataFrame([["Harsh",21],["Virat",33],["Rohit",36]],columns=["Name","Age"])

In [19]:
print(df)

    Name  Age
0  Harsh   21
1  Virat   33
2  Rohit   36

In [20]:
np_arr=np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(np_arr,columns  = ["A","B","C"])

In [21]:
print(df)

   A  B  C
0  1  2  3
1  4  5  6

In [22]:
# csv file 
df = pd.read_csv("employee_data.csv")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.DataFrame'>

In [23]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [24]:
df
# json data

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [25]:
#df = pd.read_json("employee_data.json")
#print(df,type(df))

In [28]:
# data frame methods

df = pd.read_csv("employee_data.csv")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.DataFrame'>

In [29]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [31]:
# Methods 
print( df.head()) # it  gives initial five rows of a table

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000

In [32]:
df.head()

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000

In [33]:
df.tail()

   ID    Name  Age Department  Salary
5   6   Frank   29    Finance   50000
6   7   Grace   41         HR   82000
7   8  Hannah   26  Marketing   47000
8   9     Ian   35         IT   75000
9  10   Julia   30    Finance   60000

In [34]:
df.tail(2)

   ID   Name  Age Department  Salary
8   9    Ian   35         IT   75000
9  10  Julia   30    Finance   60000

In [35]:
df.sample()

   ID   Name  Age Department  Salary
0   1  Alice   25         HR   55000

In [36]:
df.sample()

   ID   Name  Age Department  Salary
6   7  Grace   41         HR   82000

In [37]:
df.sample(5)

   ID   Name  Age Department  Salary
0   1  Alice   25         HR   55000
8   9    Ian   35         IT   75000
1   2    Bob   32         IT   72000
3   4  David   45  Marketing   91000
9  10  Julia   30    Finance   60000

In [38]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     str
 2   Age         10 non-null     int64
 3   Department  10 non-null     str
 4   Salary      10 non-null     int64
dtypes: int64(3), str(2)
memory usage: 532.0 bytes

In [40]:
df.shape

(10, 5)

In [44]:
df.describe()

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

In [45]:
df.columns

Index(['ID', 'Name', 'Age', 'Department', 'Salary'], dtype='str')

In [47]:
df.nunique()

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64